/// ===================================================
/// Power By 张风捷特烈 --- Generated file. Do not edit.
/// github: https://github.com/toly1994328
/// ===================================================

part of 'node.g.dart';

Map<String, dynamic> get _tagData => {"TagDemo1":{"title":"基础标签","desc":"展示标签的基础用法和多样化的视觉风格。第一行演示不同颜色的标签效果，第二行展示四种变体样式：填充、边框、实心、虚线。通过颜色和样式的组合，可以灵活应用于分类标记、状态展示、标签管理等场景。","code":"assets/code_res/tag_demo1.txt"},"TagDemo2":{"title":"可关闭标签","desc":"展示基于数据驱动的动态标签管理。每个标签都可以独立关闭删除，点击关闭按钮后标签从列表中移除并显示提示信息。当有标签被删除时，右侧会出现重置标签，点击可恢复所有已删除的标签。示例包含了不同样式、颜色、图标的标签组合，以及禁用状态的展示，适用于标签管理、筛选条件、关键词编辑等需要动态增删的交互场景。","code":"assets/code_res/tag_demo2.txt"},"TagDemo3":{"title":"动态添加标签","desc":"展示标签的动态增删功能。用户可以通过关闭按钮删除已有标签，也可以点击虚线边框的添加按钮创建新标签。点击添加后会出现输入框，输入内容并回车或失焦即可完成添加。新标签会自动去重和去除空白，确保标签列表的整洁性。这种交互模式常用于个人信息编辑、兴趣标签管理、技能标签设置等需要用户自定义标签内容的场景。","code":"assets/code_res/tag_demo3.txt"},"TagDemo4":{"title":"可选择标签","desc":"展示 TolyTagGroup 组件的单选和多选功能。单选模式下，点击标签会取消其他标签的选中状态，只保留当前选中项；多选模式下，可以同时选中多个标签。每个模式都实时显示当前选中的内容，提供直观的视觉反馈。示例中单选用于技术方向选择（前端、后端、移动端、人工智能），多选用于技术栈选择（Flutter、React、Vue 等）。这种交互模式广泛应用于筛选器、分类选择、问卷调查、偏好设置等需要用户选择的场景。","code":"assets/code_res/tag_demo4.txt"},"TagDemo5":{"title":"状态标签","desc":"展示带有状态指示的标签组合，通过不同的颜色和图标传达明确的状态信息。示例包含六种常见状态,每个状态都采用了符合直觉的颜色和图标搭配，特别是处理中状态使用了动态的加载指示器，提供更生动的视觉反馈。这种模式广泛应用于任务状态跟踪、审批流程、订单状态、系统通知等需要明确状态表达的场景。","code":"assets/code_res/tag_demo5.txt"}};